index.org
#+TITLE: Placeholder

* Welcome!
  This is a work in progress to set up a reasonably minimal "blog" of
  sorts -- or at least a scattering of notes and demonstrations --
  revolving around some basic emacs/org-mode use cases.

** TODO Next steps
   The idea is to document some combination of things I like to do and
   things I want to do.  Short term goals are as follows:

   1. [ ] Work out a preliminary structure of org files and HTML trees
      so new content can be added quickly and easily.
   2. [ ] Figure out a clean way to use an [[https://github.com/fniessen/org-html-themes][existing org theme]]
   3. [ ] Mock up a simple [[https://www.freecadweb.org/][FreeCAD]] python example

** TODO Wish list
   Wouldn't it be nice if I could...

   1. [ ] Integrate [[http://ivanzuzak.info/2011/02/18/github-hosted-comments-for-github-hosted-blogs.html][existing methods]] for adding comment threads?
