index.html
---
title: Testing
theme: jekyll-theme-architect
---
<body>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6a61556">1. Welcome!</a>
<ul>
<li><a href="#org128347d">1.1. <span class="todo TODO">TODO</span> Next steps</a></li>
<li><a href="#orgefd48f9">1.2. <span class="todo TODO">TODO</span> Wish list</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6a61556" class="outline-2">
<h2 id="org6a61556"><span class="section-number-2">1</span> Welcome!</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a work in progress to set up a reasonably minimal "blog" of
sorts &#x2013; or at least a scattering of notes and demonstrations &#x2013;
revolving around some basic emacs/org-mode use cases.
</p>
</div>

<div id="outline-container-org128347d" class="outline-3">
<h3 id="org128347d"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> Next steps</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The idea is to document some combination of things I like to do and
things I want to do.  Short term goals are as follows:
</p>

<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> Work out a preliminary structure of org files and HTML trees
so new content can be added quickly and easily.</li>
<li class="trans"><code>[-]</code> Figure out a clean way to use an <a href="https://github.com/fniessen/org-html-themes">existing org theme</a></li>
<li class="off"><code>[&#xa0;]</code> Mock up a simple <a href="https://www.freecadweb.org/">FreeCAD</a> python example</li>
</ol>
</div>
</div>

<div id="outline-container-orgefd48f9" class="outline-3">
<h3 id="orgefd48f9"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> Wish list</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Wouldn't it be nice if I could&#x2026;
</p>

<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> Integrate <a href="http://ivanzuzak.info/2011/02/18/github-hosted-comments-for-github-hosted-blogs.html">existing methods</a> for adding comment threads?</li>
</ol>
</div>
</div>
</div>
</body>
